In [3]:
import pandas as pd

india_weather = pd.DataFrame({
    "city":["mumbai","delhi","bangalore"],
    "temperature":[32,45,30],
    "humidity":[80,60,78]
})

india_weather

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78

In [4]:
us_weather = pd.DataFrame({
    "city":["new york","chicago","orlando"],
    "temperature":[21,14,35],
    "humidity":[68,65,75]
})

us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [9]:
df = pd.concat([india_weather, us_weather],ignore_index=True,)
df

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78
3   new york           21        68
4    chicago           14        65
5    orlando           35        75

In [10]:
df = pd.concat([india_weather, us_weather], keys=['india','us'])
df

              city  temperature  humidity
india 0     mumbai           32        80
      1      delhi           45        60
      2  bangalore           30        78
us    0   new york           21        68
      1    chicago           14        65
      2    orlando           35        75

In [12]:
df.loc["us"]

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [63]:

temperature_df = pd.DataFrame({
    #"city":["mumbai","delhi","bangalore"],
    #"temperature":[32,45,30]
    "city":["mumbai","delhi"],
    "temperature":[32,45]
})

temperature_df

     city  temperature
0  mumbai           32
1   delhi           45

In [64]:

windspeed_df = pd.DataFrame({
    #"city":["mumbai","delhi","bangalore"],
    #"windspeed":[7,12,9]
    "city":["delhi","bangalore"],
    "windspeed":[12,9]
})

windspeed_df

        city  windspeed
0      delhi         12
1  bangalore          9

In [65]:
temperature_df = temperature_df.set_index('city')
temperature_df

        temperature
city
mumbai           32
delhi            45

In [66]:
windspeed_df = windspeed_df.set_index('city')
windspeed_df

           windspeed
city
delhi             12
bangalore          9

In [67]:
df = pd.concat([temperature_df, windspeed_df], axis=1, join='outer')
df

           temperature  windspeed
city
mumbai            32.0        NaN
delhi             45.0       12.0
bangalore          NaN        9.0

In [68]:
df['city'] = df.index
df

           temperature  windspeed       city
city
mumbai            32.0        NaN     mumbai
delhi             45.0       12.0      delhi
bangalore          NaN        9.0  bangalore

In [69]:

import numpy as np
index_set= np.arange(0,len(df))

df.set_index(index_set, inplace=True)
df

   temperature  windspeed       city
0         32.0        NaN     mumbai
1         45.0       12.0      delhi
2          NaN        9.0  bangalore

In [38]:
s = pd.Series(["Dry","Humid","Rain"], name="event")
s

0      Dry
1    Humid
2     Rain
Name: event, dtype: object

In [39]:
df = pd.concat([df, s], axis=1)
df

        city  temperature       city  windspeed  event
0     mumbai           32     mumbai          7    Dry
1      delhi           45      delhi         12  Humid
2  bangalore           30  bangalore          9   Rain

In [40]:
import numpy as np
a1=np.arange(5,8)
a1=np.zeros(3, dtype=int)
a1

array([0, 0, 0])

In [41]:
pd_a1 = pd.Series(a1, name="test_col")
pd_a1

df = pd.concat([df,pd_a1],axis=1)
df

        city  temperature       city  windspeed  event  test_col
0     mumbai           32     mumbai          7    Dry         0
1      delhi           45      delhi         12  Humid         0
2  bangalore           30  bangalore          9   Rain         0